wind_wave_damping_tutorial/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            waveVelocity;
        waveDictName    waveDict;
        value           uniform (0 0 0);
    }
    
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    
    /*
    outlet
    {
        type            waveAbsorption2DVelocity;
        uCurrent        (-1.5 0. 0.);

        uWindRef       (40. 0. 0.);

        zWindRef       20;

        roughnessH     0.1;

        value           uniform (0 0 0);

    }
    */
    /*
    outlet
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    */
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    /*
    buildings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    */
    /*
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    */
    /*
    atmosphere
    {
        type            zeroGradient;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    */
    /*
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    */

    atmosphere
    {
        type            slip;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
