wind_wave_damping_tutorial/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            symmetry;
    }
    
    
    outlet 
    {
        type            calculated;
        value             uniform  0;
    }
    /*
    inlet 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    */
    inlet 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    ground
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    /*
    ground
    {
        type            zeroGradient;
    }
    */
    /*
    buildings
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    */
    /*
    atmosphere 
    {
        type            totalPressure;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    */

    atmosphere 
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    /*
    atmosphere 
    {
        type            zeroGradient;
    }
    */
}


// ************************************************************************* //
