wind_wave_damping_tutorial/constant/waveDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      waveDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveType        regular;

waveTheory      cnoidal;

genAbs          1;

absDir          0.0;

nPaddles        1;

waveHeight      2.0;

wavePeriod      12;

waveDir         0.0;

wavePhase       1.57079633;

// Change both entries to true to re-read this dictionary upon restart.
rereadAlpha     false;
rereadU         false;

uCurrent        (1.5 0. 0.);

uWindRef       (20. 0. 0.);

zWindRef       20;

roughnessH     0.003;

// ************************************************************************* //
