wind_wave_damping_tutorial/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom   mesh;

sourceCase      ".";

sourcePatches   (outlet);

flipNormals     false;

nLayers         30;

expansionRatio  1.09;

extrudeModel    linearNormal;

linearNormalCoeffs
{
    thickness       150;
}

mergeFaces      false;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
