wind_wave_damping_tutorial/system/setFieldsDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-10 -1 -1) (500 1 7.5);

        fieldValues
        (
            volScalarFieldValue alpha.water 1
            //volVectorFieldValue U           (1.5 0. 0.)
            volScalarFieldValue p_rgh       73509
        );
    }

    boxToCell
    {
        box (-10 -1 -1) (500 1 7.5);

        fieldValues
        (
            //volScalarFieldValue alpha.water 1
            volVectorFieldValue U           (1.5 0. 0.)
        );
    }
);
