wind_wave_damping_tutorial/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    /*
    buildings
    {
        type triSurfaceMesh;
        file "buildings.stl";
    }
    */

    ground
    {
        type triSurfaceMesh;
        file "ground.stl";
    }

    
    
    refinementBox
    {
        type searchableBox;
        min  (  85   9   7);
        max  (93 95  11);
    }
    
};

castellatedMeshControls
{
    features
    (
      { //file  "buildings.eMesh"; level 2;
        file  "ground.eMesh"; level 1;
      
       }
    );

    refinementSurfaces
    {
        /*
        buildings
        {
            level (2 2);
            patchInfo { type wall; }
        }
        */

        ground
        {
            level (1 1);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
        
        refinementBox
        {
            mode inside;
            levels ((1E15 3));
        }
        
        
    }

    locationInMesh (1.1 0.1 1.1);
}

/*
snapControls
{
    explicitFeatureSnap    true;
    implicitFeatureSnap    false;
}
*/
snapControls
{
    nSmoothPatch 5; // or 15; 
    tolerance 2;  // or 0.1;
    nSolveIter 30;  // or 300;
    nRelaxIter 5;   // or 15
}

addLayersControls
{
    layers
    {
        buildings
        {
            nSurfaceLayers 2;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.2;
    minThickness        1e-3;
}

meshQualityControls
{}

writeFlags
(
    noRefinement
    // scalarLevels
    // layerSets
    // layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
